app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
    def index
        @ad = {
            title: "大型廣告",
            des: "這是廣告!!!",
            action_title: "閱讀更多",
         }

         if params[:page]
             @page = params[:page].to_i
         else
            @page = 1
        end
         @first_page = 1
         @last_page = (PRODUCTS_COUNT / LIMITED_PRODUCTS_NUMBER)

        @products = Product.all